// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Получить описание подключения сервера печати.
// 
// Параметры:
//  СерверПечати - СправочникСсылка.СерверыПечати
// 
// Возвращаемое значение:
//  Структура - Получить описание подкючения сервера печати:
// * Сервер - Строка -
// * Порт - Число -
// * Пользователь - Строка -
// * Пароль - Строка -
// * ЗащищенноеСоединение - Булево -
// * Таймаут - Число -
// * Прокси - см. ОписаниеИнтернетПрокси 
Функция	ПолучитьОписаниеПодключенияСервераПечати(СерверПечати) Экспорт
	
	ОписаниеСоединения = Новый Структура;
	ОписаниеСоединения.Вставить("Сервер","");
	ОписаниеСоединения.Вставить("Порт",0);
	ОписаниеСоединения.Вставить("Пользователь","");
	ОписаниеСоединения.Вставить("Пароль","");
	ОписаниеСоединения.Вставить("ЗащищенноеСоединение",Ложь);
	ОписаниеСоединения.Вставить("Таймаут",0);
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерверыПечати.Наименование,
	|	СерверыПечати.Сервер,
	|	СерверыПечати.Порт,
	|	СерверыПечати.ЗащищенноеСоединение,
	|	СерверыПечати.Пользователь,
	|	СерверыПечати.Пароль,
	|	СерверыПечати.Таймаут
	|ИЗ
	|	Справочник.СерверыПечати КАК СерверыПечати
	|ГДЕ
	|	СерверыПечати.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",СерверПечати);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеСоединения,Выборка);
	КонецЕсли;
	
	Возврат ОписаниеСоединения;
				
КонецФункции


#КонецОбласти

#КонецЕсли
