// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Создает соединение по ссылке на сервер печати
// 
// Параметры:
//  СерверПечати - СправочникСсылка.СерверыПечати - Ссылка на элемент справочника сервер печати
// 
// Возвращаемое значение:
//  HTTPСоединение -HTTP соединение для выполнения запросов к серверу печати
Функция ПолучитьHTTPСоединениеДляСервераПечати(СерверПечати) Экспорт
	
	ОписаниеСервераПечати = Справочники.СерверыПечати.ПолучитьОписаниеПодключенияСервераПечати(СерверПечати);
				
	Соединение = Новый HTTPСоединение(ОписаниеСервераПечати.Сервер, 
									  ОписаниеСервераПечати.Порт,
									  ОписаниеСервераПечати.Пользователь,
									  ОписаниеСервераПечати.Пароль,
									  Неопределено,
									  ОписаниеСервераПечати.Таймаут);
									  
	
	Возврат Соединение;

КонецФункции

Функция ЗаписыватьИсторию() Экспорт
	
	Возврат Константы.СервисПечатиЗаписыватьИсторию.Получить();

КонецФункции

#КонецОбласти