// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Создает соединение по ссылке на сервер печати
// 
// Параметры:
//  СерверПечати - СправочникСсылка.СерверыПечати - Ссылка на элемент справочника сервер печати
// 
// Возвращаемое значение:
//  HTTPСоединение -HTTP соединение для выполнения запросов к серверу печати
Функция ПолучитьHTTPСоединениеДляСервераПечати(СерверПечати) Экспорт
	
	ОписаниеСервераПечати = Справочники.СерверыПечати.ПолучитьОписаниеПодключенияСервераПечати(СерверПечати);
				
	Соединение = Новый HTTPСоединение(ОписаниеСервераПечати.Сервер, 
									  ОписаниеСервераПечати.Порт,
									  ОписаниеСервераПечати.Пользователь,
									  ОписаниеСервераПечати.Пароль,
									  Неопределено,
									  ОписаниеСервераПечати.Таймаут);
									  
	
	Возврат Соединение;

КонецФункции

Функция ЗаписыватьИсторию() Экспорт
	
	Возврат Константы.СервисПечатиЗаписыватьИсторию.Получить();

КонецФункции

// Получить параметры бумаги по умолчанию.
// 
// Возвращаемое значение:
//  Структура - Получить параметры бумаги по умолчанию:
// * Ориентация - ПеречислениеСсылка.ОриентацияСтраницы - Ориентация страниц
// * Формат - СправочникСсылка.ФорматыБумаги - Используемый формат бумаги
Функция ПолучитьПараметрыБумагиПоУмолчанию() Экспорт

	Структура = Новый Структура();
	Структура.Вставить("Ориентация", Перечисления.ОриентацияСтраницы.Портретная);
	Структура.Вставить("Формат", Справочники.ФорматыБумаги.ПустаяСсылка());
	
	Структура.Ориентация = Константы.СервисПечатиОриентацияБумагиПоУмолчанию.Получить();
	Структура.Формат = Константы.СервисПечатиФорматБумагиПоУмолчанию.Получить();
	Возврат Структура;
	
КонецФункции

#КонецОбласти