// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Напечатать тестовые страницы без обработки результата.
// 
// Параметры:
//  Принтеры - Массив из СправочникСсылка.Принтеры
Процедура НапечататьТестовыеСтраницыБезОбработкиРезультата(Принтеры) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Принтеры);
	ФоновыеЗадания.Выполнить("СервисПечатиСервер.НапечататьТестовыеСтраницы",Массив);
	
КонецПроцедуры

// Обновить справочник принтеры.
// 
// Параметры:
//  СерверПечати - СправочникСсылка.СерверыПечати
Процедура ОбновитьСправочникПринтеры(СерверПечати) Экспорт

	Справочники.СерверыПечати.ОбновитьСправочникПринтеры(СерверПечати);

КонецПроцедуры

#КонецОбласти