// @strict-types


#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Напечатать тестовые страницы без обработки результата.
// 
// Параметры:
//  Принтеры - Массив из СправочникСсылка.Принтеры
Процедура НапечататьТестовыеСтраницыБезОбработкиРезультата(Принтеры) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Принтеры);
	ФоновыеЗадания.Выполнить("СервисПечатиСервер.НапечататьТестовыеСтраницы",Массив);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
